// search index for WYSIWYG Web Builder
var database_length = 0;

function SearchPage(url, title, keywords, description)
{
   this.url = url;
   this.title = title;
   this.keywords = keywords;
   this.description = description;
   return this;
}

function SearchDatabase()
{
   database_length = 0;
   this[database_length++] = new SearchPage("index.html", "Інформатика. 5 клас", " ІНТЕРАКТИВНИЙ ЕЛЕКТРОННИЙ ДОДАТОК   Відкрий світ цифрових можливостей!  Чому важливо знати інформатику?  Бо це мова, якою розмовляє майбутнє.  Цей е-додаток допоможе вам навчатися легко, цікаво та ефективно Що на вас чекає   Інфографіка уроку  все й одразу  Медіатека  переглядайте відеоуроки  Інтерактивні вправи  закріплюйте знання через ігри Будьте інноваційними, будьте успішними!   © 2026 ТОВ \"Генеза\"   ", "");
   this[database_length++] = new SearchPage("p1.html", "Інформатика. 5 клас", "РОЗДІЛ І  Інформаційні процеси Цифрові пристрої Цифрові технології    ", "");
   this[database_length++] = new SearchPage("p2.html", "Інформатика. 5 клас", "1.1 ПОВІДОМЛЕННЯ, ІНФОРМАЦІЯ ДАНІ ІНФОРМАЦІЙНІ ПРОЦЕСИ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p3.html", "Інформатика. 5 клас", "1.2 ОБ’ЄКТИ, ЇХ ВЛАСТИВОСТІ, ЗНАЧЕННЯ ВЛАСТИВОСТЕЙ ОБ’ЄКТА ПРОГРАМНІ ОБ’ЄКТИ ЦИФРОВІ ПРИСТРОЇ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("pro.html", "Інформатика. 5 клас", "                                                           Про інтерактивний електронний додаток  Цей електронний додаток створено для того, щоб урізноманітнити навчання за підручником, зробити його ефективнішим і цікавішим Кожен розділ, як окрема папка з документами Заходьте, обирайте потрібний пункт і опановуйте світ інформатики   Тут ви можете  ознайомитися з текстом підручника  стисло зрозуміти матеріал уроку за допомогою інфографіки  переглянути навчальні відео, отримати додаткову цікаву інформацію  перевірити свої знання за допомогою інтерактивних вправ  Системні вимоги Операційна система — Windows 7 чи пізніші версії, Linux, ChromeOS, macOS, Android, iOS Оперативна пам’ять — 4 ГБ і більше Web browser — усі, що підтримують HTML5 Місце на жорсткому диску  для роботи офлайн  — 2 ГБ і більше  Uicons Flaticon   ", "");
   this[database_length++] = new SearchPage("p4.html", "Інформатика. 5 клас", "1.3 ВИДИ КОМП’ЮТЕРІВ ПЕРСОНАЛЬНИЙ КОМП’ЮТЕР СКЛАДОВІ ПЕРСОНАЛЬНОГО КОМП’ЮТЕРА, ЇХ ПРИЗНАЧЕННЯ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p5.html", "Інформатика. 5 клас", "1.4 ОПЕРАЦІЙНА СИСТЕМА, ЇЇ ПРИЗНАЧЕННЯ ФАЙЛИ ТА ПАПКИ, ОПЕРАЦІЇ НАД НИМИ ПРИКЛАДНІ КОМП’ЮТЕРНІ ПРОГРАМИ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   return this;
}
